import java.util.Scanner;

public class chan001 {

	public static void main(String[] args) {
		/*
		 * 
		けけけけ
		けししけ
		けけけけ
				-> 2, 10		2x1 -> 10
		けけけけけ
		けしししけ
		けけけけけ
				-> 3, 12		3x1 -> 12
		けけけけけけ
		けししししけ
		けけけけけけ
				-> 4, 14		4x1 -> 14
		けけけけ
		けししけ
		けししけ
		けけけけ
				-> 4, 12		2x2 -> 12
				
		けけけけけけけ
		けしししししけ	
		けけけけけけけ
				-> 5, 16
				
		けけけけけけけけ
		けししししししけ
		けけけけけけけけ
				-> 6, 18		
				
		けけけけけ
		けしししけ
		けしししけ
		けけけけけ
				-> 6, 14		2x3 -> 14
				
		けけけけけけけけけ
		けしししししししけ
		けけけけけけけけけ
				-> 7, 20
				
		けけけけけけ
		けししししけ
		けししししけ
		けけけけけけ
				-> 8, 16		2x4 -> 16
				
		けけけけけけけけけけ
		けししししししししけ
		けけけけけけけけけけ
				-> 8, 22
				
		けけけけけけけけけけけ
		けしししししししししけ
		けけけけけけけけけけけ
				-> 9, 24
				
		けけけけけ
		けしししけ
		けしししけ
		けしししけ
		けけけけけ
				-> 9, 16		3x3 -> 18
				
				けけけけけけ
				けししししけ
				けししししけ
				けけけけけけ
				
		けけけけけけけけけけけけ
		けししししししししししけ
		けけけけけけけけけけけけ
				-> 10, 26
				
		けけけけけけけ
		けしししししけ
		けしししししけ
		けけけけけけけ
				-> 10, 18
				
		けけけけけけけけけけけけけ
		けしししししししししししけ
		けけけけけけけけけけけけけ
				-> 11, 28
				
		けけけけけけけけけけけけけけ
		けししししししししししししけ
		けけけけけけけけけけけけけけ
				-> 12, 30
				
		けけけけけけけけ
		けししししししけ
		けししししししけ
		けけけけけけけけ
				-> 12, 20
				
				
		けけけけ
		けししけ
		けししけ
		けししけ
		けししけ
		けししけ
		けししけ
		けけけけ
				
				
		(据掘 葵/1+2)x2 + (2*1)
		(据掘 葵/2+2)x2 + (2*2)
		(据掘 葵/3+2)x2 + (2*3)
										
*/
		int brown, red;
		int div[];
		Scanner s = new Scanner(System.in);
		System.out.print("哀事 展析聖 脊径馬室推 : ");
		brown = s.nextInt();
		System.out.print("察娃 展析聖 脊径馬室推 : ");
		red = s.nextInt();
		
		div = new int[red];
		int num=0;
		
		for(int i=1; i<=red; i++) {
			if(red%i==0) {
				div[num] = i;
				num++;
			}
		}
		
		
		for(int i=0; i<num; i++) {
			if((float)(num/div[i]+2)*2 + (2*div[i])==(brown))
			{
				if(red/div[i]!=1) {
				System.out.printf("%d x %d戚陥.\n", red/div[i]+2, div[i]+2);
				}
			}
			}
		
		
		}
		
		
		
	}

